// Todo: SGT Area Version 1 Update 2025.02 //
// Todo: Release: 26 December 2025 //

class SGT_Area {
  static areas = [

    {
      name: "มหานคร 1",
      zone: [
        {
          name: "กรุงเทพ 1",
          sector: [
            {
              name: "นนทบุรี",
              district: [
                "นนทบุรี",
                "บางซื่อ",
                "บางบัวทอง",
                "บางใหญ่",
                "พิมลราช"
              ]
            },
            {
              name: "ปากเกร็ด",
              district: [
                "ปากเกร็ด",
                "สามัคคี"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 9",
          sector: [
            {
              name: "ดอนเมือง",
              district: [
                "จตุจักร",
                "ดอนเมือง",
                "ลาดสวาย",
                "ลำลูกกา"
              ]
            },
            {
              name: "บางเขน",
              district: [
                "บางเขน",
                "เพิ่มสิน",
                "ยิ่งเจริญ",
                "วัชรพล",
                "สายไหม"
              ],
            },
            {
              name: "ปทุมธานี",
              district: [
                "คลองหลวง",
                "ธัญบุรี",
                "ปทุมธานี"
              ],
            }
          ]
        },
        {
          name: "กรุงเทพ 10",
          sector: [
            {
              name: "มีนบุรี",
              district: [
                "มีนบุรี",
                "สะพานสูง",
                "สุวินทวงศ์",
              ]
            },
            {
              name: "รามอินทรา",
              district: [
                "นวมินทร์",
                "รามอินทรา",
                "หทัยราษฎร์",
              ]
            },
            {
              name: "ลาดพร้าว",
              district: [
                "ลาดพร้าว",
                "วังทองหลาง",
                "เสนา",
                "หัวหมาก",
              ]
            }
          ]
        }
      ]
    },

    {
      name: "มหานคร 2",
      zone: [
        {
          name: "กรุงเทพ 2",
          sector: [
            {
              name: "ปทุมวัน",
              district: [
                "ปทุมวัน",
                "รองเมือง",
                "สัมพันธวงศ์"
              ]
            },
            {
              name: "พญาไท",
              district: [
                "ดินแดง 1",
                "ดินแดง 2",
                "พญาไท",
                "ห้วยขวาง"
              ]
            },
            {
              name: "พระนคร",
              district: [
                "เทพศิรินทร์",
                "บำรุงเมือง",
                "ป้อมปราบ",
                "พระนคร"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 3",
          sector: [
            {
              name: "คลองเตย",
              district: [
                "คลองตัน",
                "คลองเตย",
                "ปรีดี",
                "วัฒนา"
              ],
            },
            {
              name: "ประเวศ",
              district: [
                "ประเวศ",
                "ลาดกระบัง"
              ]
            },
            {
              name: "พระโขนง",
              district: [
                "บางนา",
                "พระโขนง",
                "มหาสิน",
                "อุดมสุข"
              ]
            },
            {
              name: "สวนหลวง",
              district: [
                "สวนหลวง",
                "อ่อนนุช"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 4",
          sector: [
            {
              name: "บางคอแหลม",
              district: [
                "บางคอแหลม",
                "บางโคล่",
                "ประดู่"
              ]
            },
            {
              name: "บางรัก",
              district: [
                "บางรัก",
                "สี่พระยา"
              ]
            },
            {
              name: "ยานนาวา",
              district: [
                "บางโพงพาง",
                "ยานนาวา",
                "สาธุประดิษฐ์"
              ]
            },
            {
              name: "สาทร",
              district: [
                "ตรอกจันทน์",
                "ทุ่งมหาเมฆ",
                "สาทร"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 8",
          sector: [
            {
              name: "บางพลี",
              district: [
                "บางพลี",
                "บางเสาธง",
                "ราชาเทวะ"
              ]
            },
            {
              name: "ปากน้ำ",
              district: [
                "บางปู",
                "ปากน้ำ",
                "แพรกษา"
              ]
            },
            {
              name: "พระประแดง",
              district: [
                "พระประแดง",
                "พระสมุทร",
                "สยามนิเวศน์"
              ]
            },
            {
              name: "สมุทรปราการ",
              district: [
                "สมุทรปราการ",
                "สำโรง"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "มหานคร 3",
      zone: [
        {
          name: "กรุงเทพ 5",
          sector: [
            {
              name: "ตลิ่งชัน",
              district: [
                "ฉิมพลี",
                "ตลิ่งชัน",
                "ทวีวัฒนา"
              ]
            },
            {
              name: "บางกอกน้อย",
              district: [
                "บางกอกน้อย",
                "บางกอกใหญ่",
                "บางขุนนนท์",
                "บางพลัด"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 6",
          sector: [
            {
              name: "คลองสาน",
              district: [
                "คลองต้นไทร",
                "คลองสาน",
                "ท่าดินแดง",
                "สายชล"
              ]
            },
            {
              name: "ธนบุรี",
              district: [
                "ตลาดพลู",
                "ธนบุรี"
              ]
            },
            {
              name: "มไหสวรรย์",
              district: [
                "บุคคโล",
                "มไหสวรรย์",
                "สำเหร่"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 7",
          sector: [
            {
              name: "จอมทอง",
              district: [
                "จอมทอง",
                "ชัยกูล",
                "บางค้อ",
                "โพธิ์ทอง",
                "เอกชัย"
              ]
            },
            {
              name: "ทุ่งครุ",
              district: [
                "ทุ่งครุ",
                "บางมด",
                "บุรีรมย์"
              ]
            },
            {
              name: "ราษฎร์บูรณะ",
              district: [
                "บางปะกอก",
                "ราษฎร์บูรณะ",
                "ราษฎร์พัฒนา"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 11",
          sector: [
            {
              name: "บางขุนเทียน",
              district: [
                "การเคหะ",
                "ท่าข้าม",
                "เทียนทะเล",
                "บางขุนเทียน",
                "เพชรทองคำ"
              ]
            },
            {
              name: "บางบอน",
              district: [
                "กาญจนาภิเษก",
                "กำนันแม้น",
                "บางบอน"
              ]
            }
          ]
        },
        {
          name: "กรุงเทพ 12",
          sector: [
            {
              name: "ภาษีเจริญ",
              district: [
                "บางแค",
                "ภาษีเจริญ",
                "สุขสันต์"
              ]
            },
            {
              name: "หนองแขม",
              district: [
                "หนองแขม",
                "หนองค้างพลู",
                "หลักสอง"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "กลาง",
      zone: [
        {
          name: "กลาง 1",
          sector: [
            {
              name: "กาญจนบุรี",
              district: [
                "กาญจนบุรี",
                "ท่าม่วง"
              ]
            },
            {
              name: "ชัยนาท",
              district: [
                "ขุนสรรค์",
                "เมืองชัย",
                "อุทัยธานี"
              ]
            },
            {
              name: "สระบุรี",
              district: [
                "นครนายก",
                "สระบุรี"
              ]
            },
            {
              name: "อยุธยา",
              district: [
                "ลพบุรี",
                "อยุธยา"
              ]
            },
            {
              name: "อ่างทอง",
              district: [
                "สุพรรณบุรี",
                "อ่างทอง"
              ]
            }
          ]
        },
        {
          name: "กลาง 2",
          sector: [
            {
              name: "นครปฐม",
              district: [
                "กำแพงแสน",
                "นครชัยศรี",
                "เมืองนครปฐม",
                "สามพราน"
              ]
            },
            {
              name: "เพชรบุรี",
              district: [
                "ประจวบคีรีขันธ์",
                "เพชรบุรี"
              ]
            },
            {
              name: "มหาชัย",
              district: [
                "พันท้ายนรสิงห์",
                "มหาชัย"
              ]
            },
            {
              name: "ราชบุรี",
              district: [
                "จอมบึง",
                "ดำเนินสะดวก",
                "บ้านโป่ง"
              ]
            },
            {
              name: "สมุทรสาคร",
              district: [
                "กระทุ่มแบน",
                "บ้านแพ้ว",
                "สมุทรสงคราม"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "ตะวันออก",
      zone: [
        {
          name: "ตะวันออก 1",
          sector: [
            {
              name: "ชลบุรี",
              district: [
                "ชลบุรี",
                "แสนสุข"
              ]
            },
            {
              name: "พนัสนิคม",
              district: [
                "เกาะโพธิ์",
                "พนัสนิคม"
              ]
            },
            {
              name: "พัทยา",
              district: [
                "พัทยา",
                "สัตหีบ"
              ]
            },
            {
              name: "ศรีราชา",
              district: [
                "บึง",
                "ศรีราชา",
                "แหลมฉบัง"
              ]
            }
          ]
        },
        {
          name: "ตะวันออก 2",
          sector: [
            {
              name: "จันทบุรี",
              district: [
                "จันทบุรี",
                "ท่าใหม่"
              ]
            },
            {
              name: "ตราด",
              district: [
                "ตราด",
                "หนองเสม็ด"
              ]
            },
            {
              name: "ระยอง",
              district: [
                "แกลง",
                "ตากสิน",
                "ระยอง"
              ]
            }
          ]
        },
        {
          name: "ตะวันออก 3",
          sector: [
            {
              name: "ฉะเชิงเทรา",
              district: [
                "ฉะเชิงเทรา",
                "บางปะกง"
              ]
            },
            {
              name: "ปราจีนบุรี",
              district: [
                "ปราจีนบุรี",
                "สระแก้ว"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "เหนือ",
      zone: [
        {
          name: "เหนือ 1",
          sector: [
            {
              name: "พิงคนคร",
              district: [
                "ขัวมุง",
                "สารภี",
                "สุเทพ",
                "อินทนนท์"
              ]
            },
            {
              name: "ภูพิงค์",
              district: [
                "ช้างเผือก",
                "โชตนา",
                "แม่โจ้",
                "แม่แตง",
                "แม่ฮ่องสอน"
              ]
            },
            {
              name: "หริภุญไชย",
              district: [
                "ดอยสะเก็ด",
                "ต้นเปา",
                "ลำพูน",
                "สันกำแพง",
                "สันทราย",
                "ห้วยทราย"
              ]
            }
          ]
        },
        {
          name: "เหนือ 2",
          sector: [
            {
              name: "เวียงโกศัย",
              district: [
                "เถินบุรี",
                "น่าน",
                "แพร่",
                "ลำปางหลวง",
                "สบปราบ",
                "อุตรดิตถ์"
              ]
            },
            {
              name: "เวียงละกอน",
              district: [
                "เขลางค์นคร",
                "บ้านกล้วย",
                "พระบาท",
                "เมืองปาน",
                "แม่เมาะ",
                "วังเหนือ",
                "เวียงเหนือ",
                "สบตุ๋ย"
              ]
            }
          ]
        },
        {
          name: "เหนือ 3",
          sector: [
            {
              name: "ตาก",
              district: [
                "กำแพงเพชร",
                "ตาก",
                "นครสวรรค์",
                "พิจิตร",
                "แม่สอด"
              ]
            },
            {
              name: "เมืองสองแคว",
              district: [
                "จุฬามณี",
                "ชินราช",
                "พ่อขุนผาเมือง",
                "วังจันทน์",
                "สุโขทัย"
              ]
            }
          ]
        },
        {
          name: "เหนือ 4",
          sector: [
            {
              name: "ดอยตุง",
              district: [
                "เชียงแสน",
                "แม่คำ",
                "แม่จัน",
                "แม่สาย"
              ]
            },
            {
              name: "บุษราคัม",
              district: [
                "เชียงคำ",
                "เมืองเชียงราย",
                "เมืองพะเยา",
                "เมืองพาน",
                "สันกลาง"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "อีสานตอนบน",
      zone: [
        {
          name: "อีสาน 2",
          sector: [
            {
              name: "กุมภวาปี",
              district: [
                "กุมภวาปี",
                "ตูมใต้",
                "โนนสะอาด",
                "พันดอน"
              ]
            },
            {
              name: "ศรีธาตุ",
              district: [
                "ดอนเงิน",
                "วังสามหมอ",
                "ศรีธาตุ"
              ]
            },
            {
              name: "อุดรธานี 1",
              district: [
                "ประจักษ์ศิลปาคม",
                "หนองหาน",
                "อุดร"
              ]
            }
          ]
        },
        {
          name: "อีสาน 3",
          sector: [
            {
              name: "กาฬสินธุ์",
              district: [
                "กาฬสินธุ์",
                "นาคู",
                "ห้วยผึ้ง"
              ]
            },
            {
              name: "ขอนแก่น",
              district: [
                "ขอนแก่น",
                "บ้านไผ่",
                "เมืองพล"
              ]
            },
            {
              name: "มหาสารคาม",
              district: [
                "โกสุมพิสัย",
                "พยัคฆ์",
                "มหาสารคาม"
              ]
            },
            {
              name: "ร้อยเอ็ด 1",
              district: [
                "จังหาร"
              ]
            }
          ]
        },
        {
          name: "อีสาน 5",
          sector: [
            {
              name: "บึงกาฬ",
              district: [
                "เซกา",
                "โซ่พิสัย",
                "บึงกาฬ",
                "ปากคาด",
                "พรเจริญ"
              ]
            },
            {
              name: "สกลนคร",
              district: [
                "คำบ่อ",
                "นครพนม",
                "นาหว้า",
                "เรณูนคร",
                "วังน้ำขาว",
                "วานรนิวาส",
                "วาริชภูมิ",
                "สกลนคร"
              ]
            }
          ]
        },
        {
          name: "อีสาน 6",
          sector: [
            {
              name: "จังหาร",
              district: [
                "จังหาร",
                "พลาญชัย",
                "หนองเรือ"
              ]
            },
            {
              name: "ร้อยเอ็ด",
              district: [
                "เกษตรวิสัย",
                "เมืองสรวง",
                "ร้อยเอ็ด",
                "สวนศรี",
                "อาจสามารถ"
              ]
            }
          ]
        },
        {
          name: "อีสาน 9",
          sector: [
            {
              name: "โพนทอง",
              district: [
                "คำเขื่อนแก้ว",
                "โพนทอง",
                "เมยวดี",
                "ยโสธร",
                "เสลภูมิ",
              ]
            },
            {
              name: "มุกดาหาร",
              district: [
                "คำชะอี",
                "มุกดาหาร",
                "หนองขุ่นใหญ่",
                "หนองพอก"
              ]
            }
          ]
        },
        {
          name: "อีสาน 10",
          sector: [
            {
              name: "บ้านดุง",
              district: [
                "นาซำ",
                "น้ำรอด",
                "บ้านดุง"
              ]
            },
            {
              name: "หนองคาย",
              district: [
                "เมืองเลย",
                "หนองคาย 1",
                "หนองคาย 2",
                "หนองบัวลำภู"
              ]
            },
            {
              name: "อุดรธานี 2",
              district: [
                "กุดจับ",
                "โพธิ์สว่าง",
                "แสงสว่าง"
              ]
            }
          ]
        },
      ]
    },

    {
      name: "อีสานตอนล่าง",
      zone: [
        {
          name: "อีสาน 1",
          sector: [
            {
              name: "ครบุรี",
              district: [
                "ครบุรี",
                "เสิงสาง",
                "หนองกราด"
              ]
            },
            {
              name: "ชัยภูมิ",
              district: [
                "ชัยภูมิ",
                "ตาเนิน",
                "ภักดีชุมพล",
                "ภูเขียว",
                "หนองบัวแดง",
                "หินกอง"
              ]
            },
            {
              name: "ราชสีมา",
              district: [
                "โคราช",
                "จอมพล",
                "ประทาย",
                "พิมาย"
              ]
            },
            {
              name: "สุรนารี",
              district: [
                "ปะคำ",
                "ปากช่อง",
                "สุรนารี"
              ]
            }
          ]
        },
        {
          name: "อีสาน 4",
          sector: [
            {
              name: "กันทรลักษ์",
              district: [
                "โนนเรือ",
                "ป่าไม้พัฒนา",
                "ศรีหลักเมือง",
                "เสาธงชัย"
              ]
            },
            {
              name: "ศรีสะเกษ",
              district: [
                "กันทรารมย์", 
                "ไพรบึง",
                "วังหิน",
                "ศรีมงคล",
                "ศรีสะเกษ"
              ]
            },
            {
              name: "อุทุมพร",
              district: [
                "ศิลาลาด",
                "อุทุมพร"
              ]
            },
          ]
        },
        {
          name: "อีสาน 7",
          sector: [
            {
              name: "เมืองเดช",
              district: [
                "โคกสว่าง",
                "ชัยมงคล",
                "ชัยอุดม",
                "นาจะหลวย",
                "นาเยีย",
                "น้ำยืน",
                "โนนแก้ง",
                "บุณฑริก",
                "เมืองเดช"
              ]
            },
            {
              name: "อำนาจเจริญ",
              district: [
                "ตระการพืชผล",
                "อำนาจเจริญ"
              ]
            },
            {
              name: "อุบล",
              district: [
                "เขื่องใน",
                "พิบูล",
                "วารินชำราบ",
                "ศรีเมืองใหม่",
                "สระสมิง",
                "อุบล"
              ]
            }
          ]
        },
        {
          name: "อีสาน 8",
          sector: [
            {
              name: "บุรีรัมย์ 1",
              district: [
                "พุทไธสง",
                "เมืองบุรีรัมย์",
                "สตึก",
                "สุรินทร์",
                "ห้วยราช"
              ]
            },
            {
              name: "บุรีรัมย์ 2",
              district: [
                "นางรอง",
                "บ้านกรวด",
                "ประโคนชัย"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "ใต้ตอนบน",
      zone: [
        {
          name: "ใต้ 6",
          sector: [
            {
              name: "ชุมพร",
              district: [
                "ขุนกระทิง",
                "ท่าตะเภา",
                "นาชะอัง",
                "นาทุ่ง",
                "บางหมาก"
              ]
            },
            {
              name: "ปากน้ำชุมพร",
              district: [
                "ท่ายาง",
                "ปากน้ำชุมพร",
                "หาดทรายรี"
              ]
            },
            {
              name: "ภูวารี",
              district: [
                "ทุ่งตะโก",
                "ธารน้ำลอด",
                "สวี"
              ]
            },
            {
              name: "ละแม",
              district: [
                "ทุ่งคาใหม่",
                "ทุ่งสวรรค์",
                "สวนแตง"
              ]
            },
            {
              name: "วิสัย",
              district: [
                "บ้านนา",
                "วิสัยเหนือ",
                "หาดพันไกร"
              ]
            },
            {
              name: "หลังสวน",
              district: [
                "นาพญา",
                "บางกา",
                "พะโต๊ะ"
              ]
            }
          ]
        },
        {
          name: "ใต้ 7",
          sector: [
            {
              name: "ทับสะแก",
              district: [
                "ทับสะแก",
                "แม่รำพึง",
                "ร่อนทอง"
              ]
            },
            {
              name: "ท่าแซะ",
              district: [
                "ทรัพย์ถาวร",
                "ทรัพย์ทวีคูณ",
                "ทรัพย์สมบูรณ์",
                "ทะเลทรัพย์",
                "ท่าแซะ"
              ]
            },
            {
              name: "บางสะพาน",
              district: [
                "ไชยราช",
                "ทองมงคล",
                "ธรรมรัตน์"
              ]
            },
            {
              name: "รวมเพชร",
              district: [
                "ทรัพย์ไพศาล",
                "ธารน้ำใส",
                "ประตูชัย",
                "เพชรจรัส",
                "สันตินิมิตร"
              ]
            }
          ]
        },
        {
          name: "ใต้ 8",
          sector: [
            {
              name: "กระบุรี",
              district: [
                "กระบุรี.",
                "คอคอดกระ",
                "จปร.",
                "ทุ่งมะพร้าว"
              ]
            },
            {
              name: "ระนอง",
              district: [
                "บางนอน",
                "รัตนรังสรรค์",
                "สุขสำราญ"
              ]
            },
            {
              name: "ละอุ่น",
              district: [
                "บางพรวด",
                "ละอุ่น",
                "ลำเลียง"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "ใต้ตอนกลาง",
      zone: [
        {
          name: "ใต้ 3",
          sector: [
            {
              name: "กาญจนดิษฐ์",
              district: [
                "ทุ่งทอง",
                "ธารทิพย์",
                "เพชรคีรี"
              ]
            },
            {
              name: "โชคดี",
              district: [
                "ธารา",
                "ฟ้าใส"
              ]
            },
            {
              name: "ตาปี",
              district: [
                "ชนเกษม",
                "ศรีนริศ",
                "ศรีวิชัย",
                "สุราษฎร์"
              ]
            },
            {
              name: "ท่าชนะ",
              district: [
                "ไชยา",
                "ภูตะวัน"
              ]
            },
            {
              name: "ท่าทอง",
              district: [
                "ธารทอง",
                "วังทอง"
              ]
            },
            {
              name: "เพชรภูวนะ",
              district: [
                "ขนส่ง",
                "พบเพชร",
                "ภูวนะ"
              ]
            },
            {
              name: "ร่มเย็น",
              district: [
                "ทานตะวัน",
                "เฟื่องฟ้า"
              ]
            },
            {
              name: "สมุย",
              district: [
                "เฉวง",
                "ละไม",
                "ศรีสมุย",
                "หน้าทอน"
              ]
            }
          ]
        },
        {
          name: "ใต้ 4",
          sector: [
            {
              name: "คีรีรัตน์",
              district: [
                "สุขสามวัง"
              ]
            },
            {
              name: "ชะอวด",
              district: [
                "เมืองชะอวด",
                "วังอ่าง",
                "สามตำบล"
              ]
            },
            {
              name: "ทุ่งสง",
              district: [
                "ควนกรด",
                "น้ำตกโยง",
                "ปากแพรก"
              ]
            },
            {
              name: "นครศรี",
              district: [
                "ขนอม",
                "พรหมคีรี",
                "พระพรหม",
                "เมืองคอน"
              ]
            },
            {
              name: "ปากพนัง",
              district: [
                "ฝั่งตะวันตก",
                "ฝั่งตะวันออก",
                "หัวไทร"
              ]
            },
            {
              name: "พิปูน",
              district: [
                "ฉวาง",
                "ทุ่งใหญ่",
                "เมืองพิปูน"
              ]
            }
          ]
        },
        {
          name: "ใต้ 5",
          sector: [
            {
              name: "กระบี่ 1",
              district: [
                "กลางน้ำ",
                "ต้นน้ำ",
                "ลำน้ำ"
              ]
            },
            {
              name: "กระบี่ 2",
              district: [
                "ขนาบน้ำ",
                "ปกาสัย",
                "สายน้ำ"
              ]
            },
            {
              name: "ตรัง 1",
              district: [
                "ฟ้าตรัง",
                "ฟ้าใหม่",
                "เอกไท"
              ]
            },
            {
              name: "ตรัง 2",
              district: [
                "เมืองตรัง",
                "รุ่งตะวัน"
              ]
            },
            {
              name: "อันดามัน 1",
              district: [
                "ภูเก็ต",
                "รวมทรัพย์",
                "รัษฎา"
              ]
            },
            {
              name: "อันดามัน 2",
              district: [
                "ภูธารา",
                "ภูรินท์",
                "ภูรี"
              ]
            },
            {
              name: "อันดามัน 3",
              district: [
                "เทพธาโร",
                "ภูรติ",
                "ภูรัตน์"
              ]
            }
          ]
        }
      ]
    },

    {
      name: "ใต้ตอนล่าง",
      zone: [
        {
          name: "ใต้ 1",
          sector: [
            {
              name: "เขาชัยสน",
              district: [
                "กงหรา",
                "ป่าบอน",
                "เมืองพัทลุง"
              ]
            },
            {
              name: "ควนขนุน",
              district: [
                "ดอนทราย",
                "ป่าพะยอม"
              ]
            },
            {
              name: "ทวีธรรม",
              district: [
                "เทพา",
                "นาทวี"
              ]
            },
            {
              name: "ปิติธรรม",
              district: [
                "มิตรสัมพันธ์",
                "เมืองใหม่",
                "ราษฎร์ยินดี",
                "แหลมโพธิ์"
              ]
            },
            {
              name: "ส่งเสริมธรรม",
              district: [
                "ทรายขาว",
                "สมิหลา",
                "สองทะเล"
              ]
            },
            {
              name: "สตูล",
              district: [
                "เมืองตูล",
                "ละงู"
              ]
            },
            {
              name: "สะเดา",
              district: [
                "ปาดังเบซาร์",
                "เมืองสะเดา"
              ]
            },
            {
              name: "หาดใหญ่ 1",
              district: [
                "สันติสุข",
                "หาดใหญ่ใน"
              ]
            },
            {
              name: "หาดใหญ่ 2",
              district: [
                "ทุ่งเสา",
                "พะตง"
              ]
            }
          ]
        },
        {
          name: "ใต้ 2",
          sector: [
            {
              name: "เจริญรุ่ง",
              district: [
                "คอกช้าง",
                "ชายแดน",
                "สันติภาพ",
                "สุขสวัสดิ์"
              ]
            },
            {
              name: "ทักษิณ",
              district: [
                "ปิติชัย",
                "แสงตะวัน"
              ]
            },
            {
              name: "นราธิวาส",
              district: [
                "บางนรา",
                "ร่วมใจ"
              ]
            },
            {
              name: "นิบง",
              district: [
                "ศรีลำใหม่",
                "อภิชัย"
              ]
            },
            {
              name: "ปัตตานี",
              district: [
                "ทุ่งรวงทอง",
                "เพชรเกษม",
                "แหลมทอง"
              ]
            },
            {
              name: "ยะลา",
              district: [
                "ขวัญเมือง",
                "หลักเมือง"
              ]
            },
            {
              name: "สุไหงโก-ลก",
              district: [
                "รื่นอรุณ",
                "รุ่งอรุณ",
                "แสงทอง"
              ]
            }
          ]
        }
      ]
    }

  ];

  static getVersion() {
    return "SGT_Area v1 [2025.02]";
  }

  /**
   * ดึงข้อมูลรายชื่อภูมิภาคทั้งหมด
   * @returns {Array} Array ของชื่อและตำแหน่งที่ใช้อ้างอิงไปยังภูมิภาคนั้น ๆ ออกมา
   */
  static getRegion() {
    return SGT_Area.areas.map((area, pos) => ({name: area.name, "pos": pos}));
  }

  /**
   * ดึงข้อมูลรายชื่อรวมภาคทั้งหมดในภูมิภาคที่ระบุ
   * @param {number} rg_pos ตำแหน่งภูมิภาคที่ต้องการดึงข้อมูลรายชื่อรวมภาค
   * @returns {Array} Array ของชื่อและตำแหน่งที่ใช้อ้างอิงไปยังรวมภาคนั้น ๆ ออกมา
   */
  static getZone(rg_pos) {
    let result = [];

    if (SGT_Area.isValidPosition(rg_pos, SGT_Area.areas)) {
      result = SGT_Area.areas[rg_pos].zone.map((zone, pos) => ({
        name: zone.name, "pos": pos
      }));
    }

    return result;
  }

  /**
   * ดึงข้อมูลรายชื่อภาคทั้งหมดในรวมภาคที่ระบุ
   * @param {number} rg_pos ตำแหน่งภูมิภาคที่ต้องการดึงข้อมูลรายชื่อภาค
   * @param {number} zone_pos ตำแหน่งรวมภาคที่ต้องการดึงข้อมูลรายชื่อภาค
   * @returns {Array} Array ของชื่อและตำแหน่งที่ใช้อ้างอิงไปยังภาคนั้น ๆ ออกมา
   */
  static getSector(rg_pos, zone_pos) {
    let result = [];

    if (
      SGT_Area.isValidPosition(rg_pos, SGT_Area.areas) && 
      SGT_Area.isValidPosition(zone_pos, SGT_Area.areas[rg_pos].zone)
    ) {

      result = SGT_Area.areas[rg_pos].zone[zone_pos].sector.map((sector, pos) => ({
        name: sector.name, "pos": pos
      }));

    } 
    
    return result;
  }

  /**
   * ดึงข้อมูลรายชื่อเขตทั้งหมดในภาคที่ระบุ
   * @param {number} rg_pos ตำแหน่งภูมิภาคที่ต้องการดึงข้อมูลรายชื่อเขต
   * @param {number} zone_pos ตำแหน่งรวมภาคที่ต้องการดึงข้อมูลรายชื่อเขต
   * @param {number} sec_pos ตำแหน่งภาคที่ต้องการดึงข้อมูลรายชื่อเขต
   * @returns {Array} Array ของชื่อและตำแหน่งที่ใช้อ้างอิงไปยังเขตนั้น ๆ ออกมา
   */
  static getDistrict(rg_pos, zone_pos, sec_pos) {
    let result = [];

    if (
      SGT_Area.isValidPosition(rg_pos, SGT_Area.areas) &&
      SGT_Area.isValidPosition(zone_pos, SGT_Area.areas[rg_pos].zone) &&
      SGT_Area.isValidPosition(sec_pos, SGT_Area.areas[rg_pos].zone[zone_pos].sector)
    ) {
      result = SGT_Area.areas[rg_pos].zone[zone_pos].sector[sec_pos].district.map((district, pos) => ({
        name: district, "pos": pos
      }));
    } 
    
    return result;
  }

  static isValidPosition(pos, array) {
    return pos >= 0 && pos < array.length;
  }
}